#+Title: Primeiro PWA
** Inicializando nosso diretorio como repositorio local
   Vcs sabem que pra trabalhar com heroku nosso diretorio tem que ser
   um repositorio do git ne? Por exemplo, pra gente enviar o nosso
   projeto pro heroku, por exemplo, temos que dar um git push...

   Entao e isso que vamos fazer agora, nosso projeto vai virar um
   repositorio local do git.
   
#+NAME:git init
#+BEGIN_SRC shell :session s1 :results output :exports both
cd $projDir
git init
#+END_SRC

#+RESULTS: git init
#+begin_example

hint: Using 'master' as the name for the initial branch. This default branch name
hint: is subject to change. To configure the initial branch name to use in all
hint: of your new repositories, which will suppress this warning, call:
hint:
hint: 
hint: Names commonly chosen instead of 'master' are 'main', 'trunk' and
hint: 'development'. The just-created branch can be renamed via this command:
hint:
Initialized empty Git repository in /home/wagner/fzlbpms/submodules/somewritings/pwa/projeto1/.git/
#+end_example

** Criando o main.js, o manifest.json, dog.svg e cat.svg

   Vc vai criar esses arquivos e colocar eles todos no public, ok?

   Segue o conteudo o main.js
   
   Se vc ta seguindo aqui nosso passo a passo sem ansiedade vc vai ver
   com calma esse conteudo do main.js e seria muito muito da hora se
   vc percebesse o seguinte....

   O conteudo comeca com um if, depois tem um console... e depois tem
   uma a seguinte linha "navigator.serviceWorker.register('/service-worker-minimum-to-intall-pwa.js')"

   Percebeu que esse linha ta registrando um serviceworker e esse
   service worker e um outro arquivo javascript?

   Entao deixa essa "bola quicando" que a gente pega ela daqui a
   pouquinho pra criar esse arquivo...
   
#+NAME:main.js
#+BEGIN_SRC js :session s1 :results output :exports code
if ('serviceWorker' in navigator) {
    console.log("main.js => Vamos registrar o service worker!!!");
    navigator.serviceWorker.register('/service-worker-minimum-to-intall-pwa.js')
        .then(registration => {
            console.log("main.js => Service Worker Registrado com Sucesso");
            console.dir(registration);
        })
        .catch(error => {
            console.log("main.js => Erro ao registrar Service Worker");
            console.dir(error);
        });
}

#+END_SRC

Segue o conteudo o arquivo manifest.json

#+NAME:manifest.json
#+BEGIN_SRC js :session s1 :results output :exports code
  {
    "name": "AprendendoPWA",
    "short_name": "AprendPWA",
    "description": "WEB APP para aprender PWA (Disciplina PAMII).",
    "display": "fullscreen",
    "start_url":"index.html",    
    "scope": "/",
    
    "icons": [
        {
            "src": "icon/app-icon-192x192.png",
            "sizes": "192x192",
            "type": "image/png"
        },
        {
            "src": "icon/app-icon-512x512.png",
            "sizes": "512x512",
            "type": "image/png"
        }]
}

#+END_SRC

Agora crie tb as imagens... vc pode pega-las no proprio site que esta
online usando botao direito na imagem e dando um "salvar imagem
como"... https://aprendendopwa.herokuapp.com/

*Perceba que a imagem do cachorro e do gato esta no diretorio public os icones apontados no manifest esto no diretorio icon dentro do public.*

Abaixo segue toda a estrutura do nosso projeto...


#+NAME:tree estrutura do projeto
#+BEGIN_SRC shell :session s1 :results output :exports both
cd $projDir
tree
#+END_SRC

#+RESULTS: tree estrutura do projeto
#+begin_example
 .
 composer.json
 Procfile
 public
     cat.svg
     dog.svg
     icon
         app-icon-192x192.png
          app-icon-512x512.png
     index.html
     index.php
     js
        main.js
     manifest.json

3 directories, 10 files
#+end_example


** Enviando tudo para o heroku
   Bom, temos tudo que precisamos pro nosso projeto pwa inicial
   simplizao...

   Agora a gente quer enviar tudo pro heroku certo?

   Pra isso o heroku tem que ter um projeto criado la... la no site do
   heroku... Entao o *passo1 pra enviar nosso projeto pro heroku e criar o projeto no heroku que possa receber nosso conteudo*
   
   O *passo2 pra enviar nosso projeto pro heroku e dar um git add .  nos arquivos que criamos, comitar e dar git push*
   

   Entao vamos fazer isso..

   
#+NAME:heroku create pwaproj1
#+BEGIN_SRC shell :session s1 :results output :exports both
cd $projDir
heroku create pwaproj1
#+END_SRC

#+RESULTS: heroku create pwaproj1
: 
: Creating  pwaproj1... done
: https://pwaproj1.herokuapp.com/ https://git.heroku.com/pwaproj1.git


#+NAME:git add .
#+BEGIN_SRC shell :session s1 :results output :exports both
cd $projDir
git add .
#+END_SRC

#+RESULTS: git add .



#+NAME:git status
#+BEGIN_SRC shell :session s1 :results output :exports both
cd $projDir
git status
#+END_SRC

#+RESULTS: git status
#+begin_example

 On branch master

No commits yet

Changes to be committed:
..." to unstage)
	new file:   Procfile
	new file:   composer.json
	new file:   public/cat.svg
	new file:   public/dog.svg
	new file:   public/icon/app-icon-192x192.png
	new file:   public/icon/app-icon-512x512.png
	new file:   public/index.html
	new file:   public/index.php
	new file:   public/js/main.js
	new file:   public/manifest.json
	new file:   public/service-worker-minimum-to-intall-pwa.js
#+end_example



#+NAME:git commit -am "Arquivos necessarios para proj1 pwa"
#+BEGIN_SRC shell :session s1 :results output :exports both
cd $projDir
git commit -am "Arquivos necessarios para proj1 pwa"
#+END_SRC

#+RESULTS: git commit -am "Arquivos necessarios para proj1 pwa"
#+begin_example

 [master (root-commit) f043e7d] Arquivos necessarios para proj1 pwa
 11 files changed, 103 insertions(+)
 create mode 100644 Procfile
 create mode 100644 composer.json
 create mode 100644 public/cat.svg
 create mode 100644 public/dog.svg
 create mode 100644 public/icon/app-icon-192x192.png
 create mode 100644 public/icon/app-icon-512x512.png
 create mode 100644 public/index.html
 create mode 100755 public/index.php
 create mode 100644 public/js/main.js
 create mode 100644 public/manifest.json
 create mode 100644 public/service-worker-minimum-to-intall-pwa.js
#+end_example



#+NAME:git push heroku master
#+BEGIN_SRC shell :session s1 :results output :exports both
cd $projDir
git push heroku master
#+END_SRC

#+RESULTS: git push heroku master
#+begin_example

[00m Enumerating objects: 16, done.
(1/16)Counting objects:  12% (2/16)Counting objects:  18% (3/16)Counting objects:  25% (4/16)Counting objects:  31% (5/16)Counting objects:  37% (6/16)Counting objects:  43% (7/16)Counting objects:  50% (8/16)Counting objects:  56% (9/16)Counting objects:  62% (10/16)Counting objects:  68% (11/16)Counting objects:  75% (12/16)Counting objects:  81% (13/16)Counting objects:  87% (14/16)Counting objects:  93% (15/16)Counting objects: 100% (16/16)Counting objects: 100% (16/16), done.
Delta compression using up to 4 threads
(1/13)Compressing objects:  15% (2/13)Compressing objects:  23% (3/13)Compressing objects:  30% (4/13)Compressing objects:  38% (5/13)Compressing objects:  46% (6/13)Compressing objects:  53% (7/13)Compressing objects:  61% (8/13)Compressing objects:  69% (9/13)Compressing objects:  76% (10/13)Compressing objects:  84% (11/13)Compressing objects:  92% (12/13)Compressing objects: 100% (13/13)Compressing objects: 100% (13/13), done.
(1/16)Writing objects:  12% (2/16)Writing objects:  18% (3/16)Writing objects:  25% (4/16)Writing objects:  31% (5/16)Writing objects:  37% (6/16)Writing objects:  43% (7/16)Writing objects:  50% (8/16)Writing objects:  56% (9/16)Writing objects:  62% (10/16)Writing objects:  68% (11/16)Writing objects:  75% (12/16)Writing objects:  81% (13/16)Writing objects:  87% (14/16)Writing objects:  93% (15/16)Writing objects: 100% (16/16)Writing objects: 100% (16/16), 138.61 KiB | 6.03 MiB/s, done.
Total 16 (delta 0), reused 0 (delta 0), pack-reused 0
remote: Compressing source files... done.        
remote: Building source:        
remote:
Building on the Heroku-20 stack
PHP app detected
Bootstrapping...
Installing platform packages...        
remote:        [1;33mNOTICE:[0m No runtime required in composer.lock; using PHP ^7.0.0 | ^8.0.0
remote:        - apache (2.4.46)        
remote:        - nginx (1.18.0)        
remote:        - php (8.0.2)        
remote:        - composer (1.10.20)
Installing dependencies...        
remote:        Composer version 1.10.20 2021-01-27 15:41:06        
remote:        Loading composer repositories with package information        
remote:        Updating dependencies        
remote:        Writing lock file        
remote:        Generating optimized autoload files
Preparing runtime environment...
Checking for additional extensions to install...
Discovering process types
web        
remote:
Compressing...        
remote:        Done: 15.1M
Launching...        
remote:        Released v3        
remote:        https://pwaproj1.herokuapp.com/ deployed to Heroku        
remote: 
remote: Verifying deploy... done.        
To https://git.heroku.com/pwaproj1.git
master
#+end_example


